In [1]:
import pandas as pd
import numpy as np

In [2]:
df_conflicto = pd.read_csv('ficheros/fatalities_isr_pse_conflict_2000_to_2023.csv')

In [3]:
df_conflicto.shape

(11124, 16)

In [4]:
df_conflicto.head()

,name,date_of_event,age,citizenship,event_location,event_location_district,event_location_region,date_of_death,gender,took_part_in_the_hostilities,place_of_residence,place_of_residence_district,type_of_injury,ammunition,killed_by,notes
0,'Abd a-Rahman Suleiman Muhammad Abu Daghash,2023-09-24,32.0,Palestinian,Nur Shams R.C.,Tulkarm,West Bank,2023-09-24,M,NaN,Nur Shams R.C.,Tulkarm,gunfire,live ammunition,Israeli security forces,Fatally shot by Israeli forces while standing ...
1,Usayed Farhan Muhammad 'Ali Abu 'Ali,2023-09-24,21.0,Palestinian,Nur Shams R.C.,Tulkarm,West Bank,2023-09-24,M,NaN,Nur Shams R.C.,Tulkarm,gunfire,live ammunition,Israeli security forces,Fatally shot by Israeli forces while trying to...
2,'Abdallah 'Imad Sa'ed Abu Hassan,2023-09-22,16.0,Palestinian,Kfar Dan,Jenin,West Bank,2023-09-22,M,NaN,al-Yamun,Jenin,gunfire,live ammunition,Israeli security forces,Fatally shot by soldiers while firing at them ...
3,Durgham Muhammad Yihya al-Akhras,2023-09-20,19.0,Palestinian,'Aqbat Jaber R.C.,Jericho,West Bank,2023-09-20,M,NaN,'Aqbat Jaber R.C.,Jericho,gunfire,live ammunition,Israeli security forces,Shot in the head by Israeli forces while throw...
4,Raafat 'Omar Ahmad Khamaisah,2023-09-19,15.0,Palestinian,Jenin R.C.,Jenin,West Bank,2023-09-19,M,NaN,Jenin,Jenin,gunfire,live ammunition,Israeli security forces,Wounded by soldiers’ gunfire after running awa...

In [5]:
df_conflicto.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 11124 entries, 0 to 11123
Data columns (total 16 columns):
 #   Column                        Non-Null Count  Dtype
---  ------                        --------------  -----
 0   name                          11124 non-null  object
 1   date_of_event                 11124 non-null  object
 2   age                           10995 non-null  float64
 3   citizenship                   11124 non-null  object
 4   event_location                11124 non-null  object
 5   event_location_district       11124 non-null  object
 6   event_location_region         11124 non-null  object
 7   date_of_death                 11124 non-null  object
 8   gender                        11104 non-null  object
 9   took_part_in_the_hostilities  9694 non-null   object
 10  place_of_residence            11056 non-null  object
 11  place_of_residence_district   11056 non-null  object
 12  type_of_injury                10833 non-null  object
 13  ammunition                    5871 non-null   object
 14  killed_by                     11124 non-null  object
 15  notes                         10844 non-null  object
dtypes: float64(1), object(15)
memory usage: 1.4+ MB

In [18]:
def exploracion_dataframe(dataframe):
    
    print(f"Los duplicados que tenemos en el conjunto de datos son: {dataframe.duplicated().sum()}")
    print("\n ..................... \n")
    
    
    # generamos un DataFrame para los valores nulos
    print("Los nulos que tenemos en el conjunto de datos son:")
    df_nulos = pd.DataFrame(dataframe.isnull().sum() / dataframe.shape[0] * 100, columns = ["%_nulos"])
    display(df_nulos[df_nulos["%_nulos"] > 0])
    
    print("\n ..................... \n")
    print(f"Los tipos de las columnas son:")
    display(pd.DataFrame(dataframe.dtypes, columns = ["tipo_dato"]))
    
    
    print("\n ..................... \n")
    print("Los valores que tenemos para las columnas categóricas son: ")
    dataframe_categoricas = dataframe.select_dtypes(include = "O")
    
    for col in dataframe_categoricas.columns:
        print(f"La columna {col.upper()} tiene las siguientes valore únicos:")
        display(pd.DataFrame(dataframe[col].value_counts()))

In [19]:
exploracion_dataframe(df_conflicto)

Los duplicados que tenemos en el conjunto de datos son: 7

 .....................

Los nulos que tenemos en el conjunto de datos son:

                                %_nulos
age                            1.159655
gender                         0.179791
took_part_in_the_hostilities  12.855088
place_of_residence             0.611291
place_of_residence_district    0.611291
type_of_injury                 2.615965
ammunition                    47.222222
notes                          2.517080

 .....................

Los tipos de las columnas son:

                             tipo_dato
name                            object
date_of_event                   object
age                            float64
citizenship                     object
event_location                  object
event_location_district         object
event_location_region           object
date_of_death                   object
gender                          object
took_part_in_the_hostilities    object
place_of_residence              object
place_of_residence_district     object
type_of_injury                  object
ammunition                      object
killed_by                       object
notes                           object

 .....................

Los valores que tenemos para las columnas categóricas son:
La columna NAME tiene las siguientes valore únicos:

                                    name
Name unknown to B'Tselem              23
Iyad Salah 'Abd al-Hafez Qafah         2
Muhammad Fouad Khalil Hijazi           2
Muhannad 'Omar Muhammad a-Nashasi      2
Tareq Rasmi Dufish                     2
...                                  ...
Khadrah al-'Abed Salamah Abu Daqah     1
'Amru Ramadan Hassan Abu Daqah         1
Muhammad 'Abdallah Ahmad a-Zahuq       1
Husam Jamal Hasunah Shamalakh          1
Wichlav Zalsevsky                      1

[11083 rows x 1 columns]

La columna DATE_OF_EVENT tiene las siguientes valore únicos:

            date_of_event
2008-12-27            357
2014-07-20            227
2014-08-01            207
2014-07-29            204
2009-01-04            147
...                   ...
2015-03-18              1
2015-03-07              1
2015-02-24              1
2015-01-31              1
2000-10-02              1

[2405 rows x 1 columns]

La columna CITIZENSHIP tiene las siguientes valore únicos:

             citizenship
Palestinian        10092
Israeli             1029
Jordanian              2
American               1

La columna EVENT_LOCATION tiene las siguientes valore únicos:

                     event_location
Gaza City                      2232
Rafah                           832
Khan Yunis                      538
Jabalya R.C.                    477
Beit Lahiya                     471
...                             ...
al-'Esawiyah                      1
Elazar                            1
Kibbutz Beit Govrin               1
Kh. Shuweika                      1
Masha                             1

[494 rows x 1 columns]

La columna EVENT_LOCATION_DISTRICT tiene las siguientes valore únicos:

                      event_location_district
Gaza                                     2435
North Gaza                               1910
Khan Yunis                               1394
Rafah                                    1066
Deir al-Balah                             854
Israel                                    679
Nablus                                    647
Jenin                                     512
Ramallah and al-Bira                      350
Hebron                                    347
Tulkarm                                   254
Bethlehem                                 186
East Jerusalem                            130
al-Quds                                    85
Gush Katif                                 70
Qalqiliya                                  65
Tubas                                      52
Jericho                                    48
Salfit                                     36
Gaza Strip                                  4

La columna EVENT_LOCATION_REGION tiene las siguientes valore únicos:

            event_location_region
Gaza Strip                   7733
West Bank                    2712
Israel                        679

La columna DATE_OF_DEATH tiene las siguientes valore únicos:

            date_of_death
2008-12-27            341
2014-07-20            225
2014-08-01            197
2014-07-29            196
2014-07-30            131
...                   ...
2010-09-21              1
2010-09-25              1
2010-09-15              1
2010-09-17              1
2000-10-02              1

[2593 rows x 1 columns]

La columna GENDER tiene las siguientes valore únicos:

   gender
M    9681
F    1423

La columna TOOK_PART_IN_THE_HOSTILITIES tiene las siguientes valore únicos:

                            took_part_in_the_hostilities
No                                                  4653
Yes                                                 3467
Israelis                                             771
Unknown                                              603
Object of targeted killing                           200

La columna PLACE_OF_RESIDENCE tiene las siguientes valore únicos:

              place_of_residence
Gaza city                   2283
Rafah                        892
Khan Yunis                   717
Jabalya R.C.                 565
Beit Lahiya                  479
...                          ...
al-'Auja                       1
Sheqef                         1
Rakhme                         1
Kafr Qadum                     1
Banei Ayish                    1

[580 rows x 1 columns]

La columna PLACE_OF_RESIDENCE_DISTRICT tiene las siguientes valore únicos:

                      place_of_residence_district
Gaza                                         2453
North Gaza                                   1831
Khan Yunis                                   1367
Rafah                                        1097
Deir al-Balah                                 875
Israel                                        726
Nablus                                        621
Jenin                                         540
Hebron                                        380
Ramallah and al-Bira                          295
Tulkarm                                       258
Bethlehem                                     167
East Jerusalem                                121
al-Quds                                       102
Qalqiliya                                      66
Tubas                                          56
Salfit                                         47
Jericho                                        34
Gush Katif                                     16
West Bank                                       4

La columna TYPE_OF_INJURY tiene las siguientes valore únicos:

                              type_of_injury
gunfire                                 9849
explosion                                555
shelling                                 311
stabbing                                  48
house demolition                          25
hit by a vehicle                          18
beating                                    9
stones throwing                            6
being bludgeoned with an axe               4
fire                                       4
physically assaulted                       2
physical assault                           1
Strangulation                              1

La columna AMMUNITION tiene las siguientes valore únicos:

                             ammunition
missile                            2877
live ammunition                    1514
shell                               675
explosive belt                      326
bomb                                249
mortar fire                          51
knife                                37
flechette shells                     22
rubber-coated metal bullets          19
0.22-caliber bullets                 16
phosphorus shell                     16
Qassam rocket                        15
car bomb                             15
teargas canister                     13
rocket                               12
grad rocket                           7
sponge rounds                         2
grenade                               2
flare bomb                            1
stun grenade                          1
rock                                  1

La columna KILLED_BY tiene las siguientes valore únicos:

                         killed_by
Israeli security forces      10000
Palestinian civilians         1028
Israeli civilians               96

La columna NOTES tiene las siguientes valore únicos:

                                                    notes
Killed during "Operation Defensive Shield."           113
Killed during operation "Days of Repentance".          88
Killed at police station near the Legislative C...     88
Killed during an exchange of gunfire.                  88
Killed during an IDF incursion into the refugee...     48
...                                                   ...
Killed in his home together with three other op...      1
Killed in his home together with another operat...      1
Killed together with another operative in the m...      1
Killed together with another person when riding...      1
Killed by settlers who rioted in Biddya village.        1

[6744 rows x 1 columns]

Analisis de columnas:
- age: cambiar de float a int. Mirar que hay nulos

- date_of_event: cambiar de object a formato fecha 

- date_of_death:cambiar de object a formato fecha 

- ammunition: cambiar los nulos por Unknown 

- gender: Lo cambiamos por la moda 

- took_part_in_the_hostilities: Dejamos las categorias "Yes y "No", el resto de las categorias las cambiamos por "unknown". Entendemos que la columna hace referencia a si la persona forma parte del conflicto o no y los otros valores no nos proporcionan información al respecto.

- place_of_residence: Cambiamos los nulos por categoria unknown

- place_of_residence_district: Cambiamos los nulos por categoria Unknown 

-type_of_injury : cambiamos nulos por la moda ya que hay mucha diferencia entre la categoria gunfire y el resto

- amunittion :  Mirar de cambiar los nulos por uknown

- notes: cambiamos los nulos por unknown